AWS changes are applied (IAM roles and policies created):

## terraform apply output

<details>

<summary> creation log </summary>

```
Terraform will perform the following actions:

  # module.github_actions_code_coverage_assume_role["boba"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-boba-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/boba/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["boba"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/boba:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-boba-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["boba"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-focaccia-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/focaccia/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/focaccia:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-focaccia-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-intaglio-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/intaglio/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/intaglio:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-intaglio-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-posix-space-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/posix-space/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/posix-space:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-posix-space-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-rand_mt-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/rand_mt/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/rand_mt:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-rand_mt-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-raw-parts-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/raw-parts/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/raw-parts:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-raw-parts-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.github_actions_code_coverage_assume_role["roe"].aws_iam_policy.backup will be created
  + resource "aws_iam_policy" "backup" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "artichoke-roe-repo-s3-backup-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2/roe/*"
                      + Sid      = "SyncArtifacts"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-code-coverage-us-west-2"
                      + Sid      = "ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
    }

  # module.github_actions_code_coverage_assume_role["roe"].aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:artichoke/roe:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-roe-s3-backup-"
      + path                  = "/"
      + tags_all              = {
          + "environment" = "aws"
          + "managed_by"  = "terraform"
          + "project"     = "artichoke-forge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_code_coverage_assume_role["roe"].aws_iam_role_policy_attachment.backup will be created
  + resource "aws_iam_role_policy_attachment" "backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ github_actions_code_coverage_assume_role_arn = {
      + boba          = (known after apply)
      + focaccia      = (known after apply)
      + intaglio      = (known after apply)
      + posix-space   = (known after apply)
      + rand_mt       = (known after apply)
      + raw-parts     = (known after apply)
      + roe           = (known after apply)
        # (1 unchanged element hidden)
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.github_actions_code_coverage_assume_role["roe"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["roe"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["boba"].aws_iam_role.github_role: Creating...
module.github_actions_code_coverage_assume_role["roe"].aws_iam_policy.backup: Creation complete after 0s [id=arn:aws:iam::447522982029:policy/artichoke-roe-repo-s3-backup-20220820215201567400000002]
module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_policy.backup: Creation complete after 0s [id=arn:aws:iam::447522982029:policy/artichoke-rand_mt-repo-s3-backup-20220820215201567600000004]
module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_policy.backup: Creation complete after 0s [id=arn:aws:iam::447522982029:policy/artichoke-intaglio-repo-s3-backup-20220820215201567400000001]
module.github_actions_code_coverage_assume_role["boba"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_policy.backup: Creation complete after 1s [id=arn:aws:iam::447522982029:policy/artichoke-raw-parts-repo-s3-backup-2022082021520240300000000c]
module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_policy.backup: Creating...
module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_policy.backup: Creation complete after 1s [id=arn:aws:iam::447522982029:policy/artichoke-focaccia-repo-s3-backup-2022082021520240250000000b]
module.github_actions_code_coverage_assume_role["boba"].aws_iam_policy.backup: Creation complete after 1s [id=arn:aws:iam::447522982029:policy/artichoke-boba-repo-s3-backup-2022082021520248610000000d]
module.github_actions_code_coverage_assume_role["boba"].aws_iam_role.github_role: Creation complete after 1s [id=gha-boba-s3-backup-2022082021520156830000000a]
module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_role.github_role: Creation complete after 1s [id=gha-posix-space-s3-backup-20220820215201568100000009]
module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_role.github_role: Creation complete after 1s [id=gha-intaglio-s3-backup-20220820215201567700000006]
module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_role.github_role: Creation complete after 1s [id=gha-rand_mt-s3-backup-20220820215201568000000008]
module.github_actions_code_coverage_assume_role["roe"].aws_iam_role.github_role: Creation complete after 1s [id=gha-roe-s3-backup-20220820215201568000000007]
module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_role.github_role: Creation complete after 1s [id=gha-focaccia-s3-backup-20220820215201567600000003]
module.github_actions_code_coverage_assume_role["boba"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["roe"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_role.github_role: Creation complete after 1s [id=gha-raw-parts-s3-backup-20220820215201567700000005]
module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["boba"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-boba-s3-backup-2022082021520156830000000a-2022082021520301470000000f]
module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_policy.backup: Creation complete after 0s [id=arn:aws:iam::447522982029:policy/artichoke-posix-space-repo-s3-backup-2022082021520275020000000e]
module.github_actions_code_coverage_assume_role["intaglio"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-intaglio-s3-backup-20220820215201567700000006-20220820215203022200000012]
module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_role_policy_attachment.backup: Creating...
module.github_actions_code_coverage_assume_role["roe"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-roe-s3-backup-20220820215201568000000007-20220820215203019200000011]
module.github_actions_code_coverage_assume_role["rand_mt"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-rand_mt-s3-backup-20220820215201568000000008-20220820215203019100000010]
module.github_actions_code_coverage_assume_role["focaccia"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-focaccia-s3-backup-20220820215201567600000003-20220820215203047200000013]
module.github_actions_code_coverage_assume_role["raw-parts"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-raw-parts-s3-backup-20220820215201567700000005-20220820215203051600000014]
module.github_actions_code_coverage_assume_role["posix-space"].aws_iam_role_policy_attachment.backup: Creation complete after 0s [id=gha-posix-space-s3-backup-20220820215201568100000009-20220820215203232600000015]

Apply complete! Resources: 21 added, 0 changed, 0 destroyed.

Outputs:

code_coverage_cloudfront_domain = "d2dc462cstofhc.cloudfront.net"
code_coverage_s3_bucket = "artichoke-forge-code-coverage-us-west-2"
github_actions_code_coverage_assume_role_arn = {
  "boba" = "arn:aws:iam::447522982029:role/gha-boba-s3-backup-2022082021520156830000000a"
  "focaccia" = "arn:aws:iam::447522982029:role/gha-focaccia-s3-backup-20220820215201567600000003"
  "intaglio" = "arn:aws:iam::447522982029:role/gha-intaglio-s3-backup-20220820215201567700000006"
  "posix-space" = "arn:aws:iam::447522982029:role/gha-posix-space-s3-backup-20220820215201568100000009"
  "rand_mt" = "arn:aws:iam::447522982029:role/gha-rand_mt-s3-backup-20220820215201568000000008"
  "raw-parts" = "arn:aws:iam::447522982029:role/gha-raw-parts-s3-backup-20220820215201567700000005"
  "roe" = "arn:aws:iam::447522982029:role/gha-roe-s3-backup-20220820215201568000000007"
  "strftime-ruby" = "arn:aws:iam::447522982029:role/gha-strftime-ruby-s3-backup-20220817011212567800000002"
}
github_actions_project_infrastructure_assume_role_arn = "arn:aws:iam::447522982029:role/gha-project-infrastructure-s3-ro-20220212013048188700000001"
github_actions_s3_backup_assume_role_arn = {
  "project-infrastructure" = "arn:aws:iam::447522982029:role/gha-project-infrastructure-s3-backup-20220220212010997600000001"
}
github_actions_s3_backup_s3_bucket = "artichoke-forge-github-backups-us-west-2"
```

</details>